#+PROPERTY: logging nil
#+TODO: TODO UNDERWAY | DONE CANCELED
#+TYP_TODO: MAYBE | CANCELED
#+TYP_TODO: TEMPLATE

*** cl-loop 
:PROPERTIES:
:ID:       b75e4923-0a34-4f3f-830c-f5157397add1
:END:

This works, but it helped me figure out how to use =org-element-map=, so I guess I'll use that.

#+BEGIN_SRC elisp :results verbatim
  (defun org-walk-tree (tree element-pred)
    (cl-loop for element in tree
             when (eql 'headline (car element))
             when (funcall element-pred element)
             collect (list 'headline
                           :name (org-element-property :title element)
                           :children (org-walk-tree (cddr element) element-pred))))

  (with-current-buffer (find-buffer-visiting "~/src/org-make-toc/notes.org")
    (let ((tree (cddr (org-element-parse-buffer 'headline))))
      (org-walk-tree tree (lambda (element)
                            (not (string= (org-element-property :TOC element)
                                          "ignore"))))))
#+END_SRC

#+RESULTS:
: ((headline :name "Notes" :children ((headline :name "Filter tree" :children ((headline :name "Remove ignored headings" :children ((headline :name "org-element-map" :children nil) (headline :name "Other loop" :children nil))) (headline :name "Remove too-deep headings" :children nil) (headline :name "Remove higher headings" :children nil))) (headline :name "Transform tree to org list" :children nil) (headline :name "Find TOC element" :children nil) (headline :name "Replace TOC contents with list" :children nil))))

*** org-element-map
:PROPERTIES:
:ID:       fbe83744-e0e9-4d44-8abc-e48809c96478
:END:

#+BEGIN_SRC elisp :results verbatim
    (defun org-walk-tree (tree element-pred)
      (cl-loop for element in tree
               when (eql 'headline (car element))
               when (funcall element-pred element)
               collect (list 'headline
                             :name (org-element-property :title element)
                             :children (org-walk-tree (cdddr element) element-pred))))

    (defun argh (element)
      (unless (string= (org-element-property :TOC element)
                       "ignore")
        (list 'headline
              :name (org-element-property :title element)
              :children (org-element-map (cddr element) '(headline)
                                 #'argh nil nil '(headline)))))

    (with-current-buffer (find-buffer-visiting "~/src/org-make-toc/notes.org")
      (let ((tree (cddr (org-element-parse-buffer 'headline))))
        (org-element-map tree '(headline) #'argh nil nil '(headline))))

#+END_SRC

#+RESULTS:
: ((headline :name "Notes" :children ((headline :name "Filter tree" :children ((headline :name "Use treepy to walk the tree" :children nil) (headline :name "Remove ignored headings" :children ((headline :name "cl-loop" :children nil) (headline :name "org-element-map" :children nil))) (headline :name "Remove too-deep headings" :children nil) (headline :name "Remove higher headings" :children nil))) (headline :name "Transform tree to org list" :children nil) (headline :name "Find TOC element" :children nil) (headline :name "Replace TOC contents with list" :children nil))))

**** DONE Get TOC level
CLOSED: [2017-08-02 Wed 02:06]
:PROPERTIES:
:ID:       b2f133c6-7d1e-4eb9-986a-cfb5aecb3905
:END:
:LOGBOOK:
-  State "DONE"       from              [2017-08-02 Wed 02:06]
:END:

Ugly, but it works.  I guess the rather non-standard structure of the element tree makes this necessary.  I tried to get =treepy= working with zippers, and I almost did...

#+BEGIN_SRC elisp
  (defun org-make-toc--first-in-tree (tree element-pred)
    (cl-loop for element in tree
             for type = (car element)
             if (eq 'headline type)
             for result = (funcall element-pred element)
             if result
             return result
             else
             for children = (cddr element)
             when children
             for result = (org-make-toc--first-in-tree children element-pred)
             when result
             return result))
#+END_SRC

#+BEGIN_SRC elisp
  (with-current-buffer (find-buffer-visiting "~/src/org-make-toc/test/data.org")
    (let* ((tree (cddr (org-element-parse-buffer 'headline)))
           (tree (org-make-toc--remove-ignored-entries tree))
           (toc-level (org-make-toc--first-in-tree tree
                                                   #'org-make-toc--is-toc-entry
                                                   #'org-make-toc--element-level)))
      toc-level))
#+END_SRC

#+RESULTS:
: 2

*** DONE Remove ignored headings
CLOSED: [2017-08-02 Wed 00:57]
:LOGBOOK:
-  State "DONE"       from "TODO"       [2017-08-02 Wed 00:57]
:END:

#+BEGIN_SRC elisp 
  (with-current-buffer (find-buffer-visiting "~/src/org-make-toc/test/data.org")
    (let ((tree (cddr (org-element-parse-buffer 'headline))))
      (org-make-toc--remove-ignored-entries tree)))
#+END_SRC

#+RESULTS:
| headline | A               | ((headline Contents ((headline Hmm nil))) (headline A1 nil) (headline A2 nil) (headline A3 nil)) |
| headline | B               | ((headline B1 nil) (headline B2 nil) (headline B3 nil))                                          |
| headline | Ignore-Children |                                                                                                  |
| headline | C               | ((headline C1 nil) (headline C2 nil) (headline C3 nil))                                          |
| headline | Invalid         | nil                                                                                              |

** TODO Replace TOC contents with list

#+BEGIN_SRC elisp
  (with-current-buffer (find-buffer-visiting "~/src/org-make-toc/test/data.org")
    (-when-let* ((tree (cddr (org-element-parse-buffer 'headline)))
                 (tree (org-make-toc--remove-ignored-entries tree))
                 (tree (org-make-toc--remove-higher-level-than-toc tree))
                 (list (org-make-toc--tree-to-list tree))
                 (pos (org-find-property "TOC" "this")))
      (org-make-toc--replace-entry-contents pos list)))

#+END_SRC

#+RESULTS:
#+begin_example
    - [[#hmm][Hmm]]
    - [[#oho][Oho]]
   - [[#a1][A1]]
   - [[#a2][A2]]
   - [[#a3][A3]]
   - [[#b1][B1]]
   - [[#b2][B2]]
   - [[#b3][B3]]
   - [[#c1][C1]]
   - [[#c2][C2]]
   - [[#c3][C3]]
#+end_example

